app/interactors/build_operation.rb

SELECT  "reports".* FROM "reports" WHERE "reports"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
  def verify_params
    context.fail!(errors: ['Missing lines']) unless context.lines.present?
    context.fail!(errors: ['Missing report']) unless context.report.present?