app/interactors/commit_operation.rb

SELECT "operations".* FROM "operations" WHERE "operations"."report_id" = $1  [["report_id", 6]]
DELETE FROM "operations" WHERE "operations"."id" = $1  [["id", 43]]
---
  def call
    context.report.operations.destroy_all if context.report&.operations&.present?