app/controllers/reports_controller.rb

  def index
    @reports = current_user.reports.includes(:operations).all
---
SELECT "operations".* FROM "operations" WHERE "operations"."report_id" IN ($1, $2)  [["report_id", 1], ["report_id", 2]]
SELECT "reports".* FROM "reports" WHERE "reports"."user_id" = $1  [["user_id", 1]]

  def create
    @report = current_user.reports.build(report_params)
    if @report.save
---
INSERT INTO "reports" ("user_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["user_id", 1], ["created_at", "2020-06-07 22:55:34.439894"], ["updated_at", "2020-06-07 22:55:34.439894"]]

  def parse
    report = Report.find_by(id: params[:report_id])
---
SELECT  "reports".* FROM "reports" WHERE "reports"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]

  def show
    @report = Report.find_by(id: params[:id].to_i)
    if @report.present? && @report.user == current_user
      @operations = @report.operations.all
---
SELECT  "reports".* FROM "reports" WHERE "reports"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "operations".* FROM "operations" WHERE "operations"."report_id" = $1  [["report_id", 1]]