app/views/reports/index.html.slim

                  td = report.created_at.strftime("%d/%m/%Y")
                  td = report.operations.present? ? report.operations.sum(&:amount).format : 'No operations in report'
---
SELECT "operations".* FROM "operations" WHERE "operations"."report_id" IN ($1, $2, $3, $4)  [["report_id", 1], ["report_id", 2], ["report_id", 3], ["report_id", 6]]