app/views/reports/show.html.slim

            tbody
              - @report.operations.each do |op|
---
SELECT "operations".* FROM "operations" WHERE "operations"."report_id" = $1  [["report_id", 6]]